#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=8ea5a53e0c596a9bbc5c054b48c2568da4e818cd]
null_resource.k3s_ansible_host_cloud_config_provisioner: Refreshing state... [id=3696226729058055988]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/120]
proxmox_vm_qemu.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/qemu/203]
proxmox_vm_qemu.workstation-1: Refreshing state... [id=milky-polaris/qemu/123]
proxmox_vm_qemu.gateway-1: Refreshing state... [id=milky-capella/qemu/122]
proxmox_vm_qemu.k3s-worker-01: Refreshing state... [id=milky-polaris/qemu/127]
proxmox_vm_qemu.k3s-controller-01: Refreshing state... [id=milky-capella/qemu/125]
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/121]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # null_resource.k3s_ansible_host_cloud_config_provisioner will be destroyed
  # (because null_resource.k3s_ansible_host_cloud_config_provisioner is not in configuration)
  - resource "null_resource" "k3s_ansible_host_cloud_config_provisioner" {
      - id = "3696226729058055988" -> null
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/203"
        name                   = "solufit-cloudflare-tunnel-1"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/121"
        name                   = "solufit-cloudflare-tunnel-2"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/120"
        name                   = "solufit-cloudflare-tunnel-3"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.gateway-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "gateway-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/122"
        name                   = "ssh-gateway-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-ansible-host will be created
  + resource "proxmox_vm_qemu" "k3s-ansible-host" {
      + additional_wait        = 5
      + agent                  = 0
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = "virtio0"
      + cicustom               = <<-EOT
            #cloud-config
            package_update: true
            package_upgrade: true
            packages:
              - python3
              - python3-pip
              - python3-venv
              - ansible-core
              - ansible-lint
              - ansible-mitogen
              - git
            
            users:
              - name: ubuntu
                sudo: ALL=(ALL) NOPASSWD:ALL
                groups: sudo
                shell: /bin/bash
                ssh_authorized_keys:
                  - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
            
                  - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
                ssh_import_id:
                  - gh:walkmana-25
                  - gh:sasanqua-dev
            
            
            write_files:
              - content: |
                  -----BEGIN OPENSSH PRIVATE KEY-----
            b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAABlwAAAAdzc2gtcn
            NhAAAAAwEAAQAAAYEAumob689Rh9CsWYQlTcMVgdViUzhgXHC1wwiBAs8wtphuGp1Qo3me
            ZMhwkrztrJgEgAlDqLrYZV6u8Q1xRExP3KClXtH0p1OgKU4zFvauFPQbI73MdhuGBDcW4C
            QGiGIgPA8N2cNnwUFCJIcToV4MERCtMZffJ/PNLsyGdzxTlLvjbzbvEqCTolavL4HX7dhF
            mowA0vS9Q0YfDkdAp0KP0bDXS+juEZ2zxiQhzzLrSym3bGszAcz42eA4KhfPPqwuQ2gBFz
            5QGdZh64mQxDpWEKDhU0sCnGmH4ybzjWPc0lmIHRGOZbKzKSVg97vRbr8olmjTwpQK3Fjn
            eM7xNc/llgzxH1UrfqXunjLm3/Z2df0T7D/JroF9ozmjBXTI1jeIDJPneIv/UG0UMp5ToV
            VqNS8JhNOECCUcOpOEzXLOk4XuX3cC178fUFiOwsDqVMb3OgsWjddPcmQXPEntBnV+HYz7
            Pex+MGEnQV+qVqGrLQuZbnVWF5RNd80jhO+gQJ3rAAAFkFf6moZX+pqGAAAAB3NzaC1yc2
            EAAAGBALpqG+vPUYfQrFmEJU3DFYHVYlM4YFxwtcMIgQLPMLaYbhqdUKN5nmTIcJK87ayY
            BIAJQ6i62GVervENcURMT9ygpV7R9KdToClOMxb2rhT0GyO9zHYbhgQ3FuAkBohiIDwPDd
            nDZ8FBQiSHE6FeDBEQrTGX3yfzzS7Mhnc8U5S742827xKgk6JWry+B1+3YRZqMANL0vUNG
            Hw5HQKdCj9Gw10vo7hGds8YkIc8y60spt2xrMwHM+NngOCoXzz6sLkNoARc+UBnWYeuJkM
            Q6VhCg4VNLApxph+Mm841j3NJZiB0RjmWysyklYPe70W6/KJZo08KUCtxY53jO8TXP5ZYM
            8R9VK36l7p4y5t/2dnX9E+w/ya6BfaM5owV0yNY3iAyT53iL/1BtFDKeU6FVajUvCYTThA
            glHDqThM1yzpOF7l93Ate/H1BYjsLA6lTG9zoLFo3XT3JkFzxJ7QZ1fh2M+z3sfjBhJ0Ff
            qlahqy0LmW51VheUTXfNI4TvoECd6wAAAAMBAAEAAAGAOT7LizszqNb6jlTH1dzyNlguZS
            r7YHfWQWnToGa66V/e8/paYJFBBGcPNuigvi9CtoThy6dxO5P7ehfsMBKVNcX5cqhcDqRe
            G0Eh7Evdgp7B1NR8vMpP+exm8HbvsKMdjgP7d2OL8atWIfx/GT9VyknKPeALDexPFq+FHY
            mfix21xpniieBY5fHjw12Gz0nqef7DZAT3N/kJIWvdHWAR5U1+mBeUQEGjCtZesY/L9N1/
            L+Ktm8BzrQivhrGgGXlrByccC0x6jwOWUOBb3g3+KgehuAlWEO3SJDj/siSGUYT433iXDc
            L+/uSg7PP7SmlEi2PgLKYyHbbeFEjYzG8yExc/sYeLlcDqCcu/PdXypPT/gSsjV3KK6KoY
            mmWdsILili1/TT+jYokyYbQsHGI085634TML2l7/qUMfNSW/9Gggn0ght6+lYWwywezc3Q
            S3YP5S1X6lU5aMeBUUmAfofLcH9IQYLk2tFe87mfEnZCMnnbGMDkvJ4ZagzrGTLiHJAAAA
            wA8XPC76u7OEp2iv7l70/To5ClywCRDjhwewZKcwx+ooup1nNQVzMZTOuq3OGLyKdymr9l
            R0Tb2sPcNTT1GiwkrjmoM+f/N6k+mVCVvJeqLzNwXY2gMJGlEzbFOYfwo2d+5/8L3yCrBM
            BRNqxZTsxHaqUDHi1ISBSI9j40c5QsDN9nlv+7FFGHHZY+kqivXGjVXGznK1CApyicz/wW
            BWfg8Rkv6opmzo6cX6wqkhgxTOs8H+79adHUx2BZFMKeaAGgAAAMEA6HewxvRMTMqetixe
            V9erhww+IAlDcBY6wY3KpgDftF2DMVdDhvRpYoj9CEiL1SAbspj1ai18ods3c0jd3d7XbX
            lRpuQ76cBY4QzbKhVc/iF2V8CldAiN8HBGVV6XKOXnGhFpxm1HdEM3scHecw8eHzJPwDtM
            4hVrvktrmSq6bbbrbKtFS5rSKKaZti3gePtt+5r4DvNq7ff1BA207pGZ3r29MZHJF20G1p
            7jSNgr/U8ckmBaovBooD0w9qoHr0ZZAAAAwQDNSPiLqQexhILRwabIRxyJD8qHZM1ic4IF
            bXrOqyacG5KwHXPK9Nke9rS5/rHWZCZuFNSGZ6CHERD0KwEeR/dAjnLU8hUYk33UH74PHy
            YWe6rvI4saDnbAlOAMmqkxuOcRBj2TmuQSucdM0nzLBxe8+b/Hfuhv74UHr1K3EIwl28T9
            VNAnK7XFdMiYzNQ4FdekXlnp+AzP1EeIW+jBki7q6DDbWWUM+RhjoCzezUbe2rusg0T3sR
            1B8olcs+txheMAAAAXeXV1dGFAeXV1dGEtVGhpbmtQYWRFMTQBAgME
            -----END OPENSSH PRIVATE KEY-----
            
                path: /home/ubuntu/.ssh/id_rsa
                permissions: '0600'
                owner: ubuntu:ubuntu
        EOT
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 2
      + cpu                    = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.5/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "k3s-ansible-host"
      + nameserver             = (known after apply)
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.5"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_private_key        = (sensitive value)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-capella"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "16G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = true
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-controller-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-controller-01" {
      + bootdisk               = "virtio0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/125"
        name                   = "solufit-k3s-controller-01"
      ~ ssh_private_key        = (sensitive value)
        tags                   = null
        # (66 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-worker-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-worker-01" {
      + bootdisk               = "virtio0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/127"
        name                   = "solufit-k3s-worker-01"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.workstation-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "workstation-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/123"
        name                   = "workstation-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.

Warning: Missing resource schema from provider

No resource schema found for local_file when decoding prior state

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Walkmana-25, Action: `pull_request`*